/*************************************************************
 * 객체 지향 프로그래밍에서 클래스를 사용하는 프로그램       *
 *************************************************************/
#include <iostream>
using namespace std;

/************************************************************
 * 클래스 정의                                              *
 * 데이터 멤버와 멤버 함수를 선언                           *
 ************************************************************/
class Pockemon
{
private:
    string name;
    int hp;
public:
    Pockemon() {
        cout << "야생의 ...가 나타났다\n";

    }
    Pockemon(string n, int h) {
        name = n;
        hp = h;
        cout << "야생의 " << n << "가 나타났다\n";
    }
    void attack() {
        cout << "공격\t";
    }

};

/********************************************************
 * 애플리케이션 부분                                    *
 * 클래스를 인스턴스화해서 객체를 만들고 활용           *
*********************************************************/
int main()
{
    Pockemon pikachu("피카츄", 99);
    Pockemon firy;
   
    return 0;
}